app/controllers/admin/dashboard_controller.rb

    def index
      @hotels = Hotel.all
      @bookings = Booking.all
      @users = User.all
---
SELECT "hotels".* FROM "hotels"
SELECT "bookings".* FROM "bookings"
SELECT "users".* FROM "users"