app/controllers/admin/hotels_controller.rb

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @hotel = Hotel.find(params[:id])

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hotel
      @hotel = Hotel.find(params[:id])