app/controllers/hotels_controller.rb

SELECT "hotels".* FROM "hotels"
---
  def index
    @hotels = Hotel.all