app/controllers/sessions_controller.rb

  def create
    puts params[:email]
    user = User.find_by_email(params[:session][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "freida@email.com"], ["LIMIT", 1]]